/*****************************************************************************
 *
 * Copyright (C) 2008 Atmel Corporation
 * 
 * Model        : UC3A3128
 * Revision     : $Revision: 58751 $
 * Checkin Date : $Date: 2008-09-15 15:20:42 +0200 (Mon, 15 Sep 2008) $ 
 *
 ****************************************************************************/
#ifndef AVR32_MSI_210_H_INCLUDED
#define AVR32_MSI_210_H_INCLUDED

#include "avr32/abi.h"


/*
 Note to user:

 The following defines are always generated:
 - Register offset: AVR32_MSI_<register>
 - Bitfield mask:   AVR32_MSI_<register>_<bitfield>
 - Bitfield offset: AVR32_MSI_<register>_<bitfield>_OFFSET
 - Bitfield size:   AVR32_MSI_<register>_<bitfield>_SIZE
 - Bitfield values: AVR32_MSI_<register>_<bitfield>_<value name>

 The following defines are generated if they don't cause ambiguities,
 i.e. the name is unique, or all values with that name are the same.
 - Bitfield mask:   AVR32_MSI_<bitfield>
 - Bitfield offset: AVR32_MSI_<bitfield>_OFFSET
 - Bitfield size:   AVR32_MSI_<bitfield>_SIZE
 - Bitfield values: AVR32_MSI_<bitfield>_<value name>
 - Bitfield values: AVR32_MSI_<value name>

 All defines are sorted alphabetically.
*/


#define AVR32_MSI_BRQ                                               1
#define AVR32_MSI_BRQ_MASK                                 0x00000002
#define AVR32_MSI_BRQ_OFFSET                                        1
#define AVR32_MSI_BRQ_SIZE                                          1

#define AVR32_MSI_RST                                              15
#define AVR32_MSI_RST_MASK                                 0x00008000
#define AVR32_MSI_RST_OFFSET                                       15
#define AVR32_MSI_RST_SIZE                                          1
#define AVR32_MSI_SRAC                                             14
#define AVR32_MSI_SRAC_MASK                                0x00004000
#define AVR32_MSI_SRAC_OFFSET                                      14
#define AVR32_MSI_SRAC_SIZE                                         1
#define AVR32_MSI_TBE                                              10
#define AVR32_MSI_TBE_MASK                                 0x00000400
#define AVR32_MSI_TBE_OFFSET                                       10
#define AVR32_MSI_TBE_SIZE                                          1
#define AVR32_MSI_TDE                                               8
#define AVR32_MSI_TDE_MASK                                 0x00000100
#define AVR32_MSI_TDE_OFFSET                                        8
#define AVR32_MSI_TDE_SIZE                                          1
#define AVR32_MSI_TOE                                               4
#define AVR32_MSI_TOE_MASK                                 0x00000010
#define AVR32_MSI_TOE_OFFSET                                        4
#define AVR32_MSI_TOE_SIZE                                          1
#define AVR32_MSI_TPC                                              12
#define AVR32_MSI_TPC_MASK                                 0x0000f000
#define AVR32_MSI_TPC_OFFSET                                       12
#define AVR32_MSI_TPC_SIZE                                          4
#define AVR32_MSI_VERSION                                  0x00000024
#define AVR32_MSI_VERSION_MASK                             0x00000fff
#define AVR32_MSI_VERSION_OFFSET                                    0
#define AVR32_MSI_VERSION_RESETVALUE                       0x00000210
#define AVR32_MSI_VERSION_SIZE                                     12
#define AVR32_MSI_VERSION_VERSION                                   0
#define AVR32_MSI_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_MSI_VERSION_VERSION_OFFSET                            0
#define AVR32_MSI_VERSION_VERSION_SIZE                             12

#define AVR32_TPC_EX_SET_CMD                           0x00009000
#define AVR32_TPC_GET_INT                              0x00007000
#define AVR32_TPC_READ_LONG_DATA                       0x00002000
#define AVR32_TPC_READ_REG                             0x00004000
#define AVR32_TPC_READ_SHORT_DATA                      0x00003000
#define AVR32_TPC_SET_CMD                              0x0000e000
#define AVR32_TPC_SET_RW_ADRS_REG                      0x00008000
#define AVR32_TPC_WRITE_LONG_DATA                      0x0000d000
#define AVR32_TPC_WRITE_REG                            0x0000b000
#define AVR32_TPC_WRITE_SHORT_DATA                     0x0000c000



#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_msi_mscmd_t {
    unsigned int                 :16;
    unsigned int tpc             : 4;
    unsigned int                 : 1;
    unsigned int dsl             : 1;
    unsigned int dsz             :10;
} avr32_msi_mscmd_t;



typedef struct avr32_msi_mssr_t {
    unsigned int                 :15;
    unsigned int ista            : 1;
    unsigned int                 : 3;
    unsigned int rdy             : 1;
    unsigned int                 : 6;
    unsigned int emp             : 1;
    unsigned int ful             : 1;
    unsigned int ced             : 1;
    unsigned int err             : 1;
    unsigned int brq             : 1;
    unsigned int cnk             : 1;
} avr32_msi_mssr_t;



typedef struct avr32_msi_mssys_t {
    unsigned int                 : 8;
    unsigned int clkdiv          : 8;
    unsigned int rst             : 1;
    unsigned int srac            : 1;
    unsigned int                 : 1;
    unsigned int nocrc           : 1;
    unsigned int                 : 2;
    unsigned int fclr            : 1;
    unsigned int fdir            : 1;
    unsigned int                 : 3;
    unsigned int rei             : 1;
    unsigned int reo             : 1;
    unsigned int bsy             : 3;
} avr32_msi_mssys_t;



typedef struct avr32_msi_msisr_t {
    unsigned int                 :20;
    unsigned int rbf             : 1;
    unsigned int tbe             : 1;
    unsigned int rde             : 1;
    unsigned int tde             : 1;
    unsigned int                 : 2;
    unsigned int cd              : 1;
    unsigned int toe             : 1;
    unsigned int crc             : 1;
    unsigned int msint           : 1;
    unsigned int drq             : 1;
    unsigned int pend            : 1;
} avr32_msi_msisr_t;



typedef struct avr32_msi_msiscr_t {
    unsigned int                 :20;
    unsigned int rbf             : 1;
    unsigned int tbe             : 1;
    unsigned int rde             : 1;
    unsigned int tde             : 1;
    unsigned int                 : 2;
    unsigned int cd              : 1;
    unsigned int toe             : 1;
    unsigned int crc             : 1;
    unsigned int msint           : 1;
    unsigned int drq             : 1;
    unsigned int pend            : 1;
} avr32_msi_msiscr_t;



typedef struct avr32_msi_msier_t {
    unsigned int                 :20;
    unsigned int rbf             : 1;
    unsigned int tbe             : 1;
    unsigned int rde             : 1;
    unsigned int tde             : 1;
    unsigned int                 : 2;
    unsigned int cd              : 1;
    unsigned int toe             : 1;
    unsigned int crc             : 1;
    unsigned int msint           : 1;
    unsigned int drq             : 1;
    unsigned int pend            : 1;
} avr32_msi_msier_t;



typedef struct avr32_msi_msidr_t {
    unsigned int                 :20;
    unsigned int rbf             : 1;
    unsigned int tbe             : 1;
    unsigned int rde             : 1;
    unsigned int tde             : 1;
    unsigned int                 : 2;
    unsigned int cd              : 1;
    unsigned int toe             : 1;
    unsigned int crc             : 1;
    unsigned int msint           : 1;
    unsigned int drq             : 1;
    unsigned int pend            : 1;
} avr32_msi_msidr_t;



typedef struct avr32_msi_msimr_t {
    unsigned int                 :20;
    unsigned int rbf             : 1;
    unsigned int tbe             : 1;
    unsigned int rde             : 1;
    unsigned int tde             : 1;
    unsigned int                 : 2;
    unsigned int cd              : 1;
    unsigned int toe             : 1;
    unsigned int crc             : 1;
    unsigned int msint           : 1;
    unsigned int drq             : 1;
    unsigned int pend            : 1;
} avr32_msi_msimr_t;



typedef struct avr32_msi_version_t {
    unsigned int                 :20;
    unsigned int version         :12;
} avr32_msi_version_t;



typedef struct avr32_msi_t {
  union {
          unsigned long                  mscmd     ;//0x0000
          avr32_msi_mscmd_t              MSCMD     ;
  };
          unsigned long                  msdat     ;//0x0004
  union {
    const unsigned long                  mssr      ;//0x0008
    const avr32_msi_mssr_t               MSSR      ;
  };
  union {
          unsigned long                  mssys     ;//0x000c
          avr32_msi_mssys_t              MSSYS     ;
  };
  union {
    const unsigned long                  msisr     ;//0x0010
    const avr32_msi_msisr_t              MSISR     ;
  };
  union {
          unsigned long                  msiscr    ;//0x0014
          avr32_msi_msiscr_t             MSISCR    ;
  };
  union {
          unsigned long                  msier     ;//0x0018
          avr32_msi_msier_t              MSIER     ;
  };
  union {
          unsigned long                  msidr     ;//0x001c
          avr32_msi_msidr_t              MSIDR     ;
  };
  union {
    const unsigned long                  msimr     ;//0x0020
    const avr32_msi_msimr_t              MSIMR     ;
  };
  union {
    const unsigned long                  version   ;//0x0024
    const avr32_msi_version_t            VERSION   ;
  };
} avr32_msi_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_MSI_210_H_INCLUDED*/
#endif

